<?php
$config['shunfeng'] = [
    'appID' => '00029291',
    'appKey' => [
        'dev' => '345ABEF53B6F4A75463A3D625F9763BB',
        'production' => '517578D70E780007255F02C4906DC1B9',
    ],
    'devCustid' => [
        'a429262687' => '7550010173',
    ],
    'productCustid' => [
        //todo  待不同酒店配好月结卡再弄 注意测试生成的inter_id不一样
        //金房卡
        'a429262688' => '0200005819',
        //广州君悦酒店
        'a495782075' => '0200630296',
        //长沙芙蓉国温德姆
        'a495077577' => '7312006604',
        //好友缘国宴
        'a500371949' => '7711013920',
        //金陵连锁酒店
        'a492669988' => '0255037004',
        //长沙世纪金源大饭店
        'a496629410' => '7312006894'
    ],
    'deliverInfo' => [
        'a495077577' => [
            "address" => "长沙市芙蓉中路二段106号",
            "city" => "长沙市",
            "company" => "长沙芙蓉国温德姆至尊豪廷大酒店",
            "contact" => "伍琼娜",
            "country" => "中国",
            "county" => "芙蓉区",
            "mobile" => "13507483549",
            "province" => "湖南省",
            "shipperCode" => "410011",
            "tel" => "13507483549"
        ],
        'a500371949' => [
            "address" => "广西省南宁市洞岭路2号",
            "city" => "南宁市",
            "company" => "南宁市好友缘国宴饭店有限公司",
            "contact" => "雷舒",
            "country" => "中国",
            "county" => "江南区",
            "mobile" => "18176713187",
            "province" => "广西省",
            "shipperCode" => "530031",
            "tel" => "18176713187"
        ],
        'a492669988' => [
            "address" => "南京市鼓楼区新街口汉中路2号",
            "city" => "南京市",
            "company" => "金陵饭店",
            "contact" => "月饼仓库",
            "country" => "中国",
            "county" => "鼓楼区",
            "mobile" => "025-84711888-84652",
            "province" => "江苏省",
            "shipperCode" => "210009",
            "tel" => "025-84711888-84652"
        ],
        'a496629410' => [
            "address" => "长沙市开福区金泰路199号",
            "city" => "长沙市",
            "company" => "长沙世纪金源大饭店",
            "contact" => "徐锴",
            "country" => "中国",
            "county" => "开福区",
            "mobile" => "18008482709",
            "province" => "湖南省",
            "shipperCode" => "410000",
            "tel" => "18008482709"
        ]

    ],
    'specialHotel' => ['a495077577', 'a500371949', 'a492669988', 'a496629410']

];
