<?php
class Hotel {
	protected $hotels = array(
		'001'=>'顺德碧桂园度假村',
		'002'=>'碧桂花城大酒店',
		'003'=>'广州凤凰城酒店',
		'004'=>'阳江碧桂园凤凰酒店',
		'005'=>'台山碧桂园凤凰酒店',
		'006'=>'高明碧桂园凤凰酒店',
		'007'=>'新会碧桂园凤凰酒店',
		'008'=>'五邑碧桂园凤凰酒店',
		'009'=>'长沙碧桂园凤凰酒店',
		'010'=>'碧桂园假日半岛酒店',
		'011'=>'鹤山碧桂园凤凰酒店',
		'012'=>'肇庆碧桂园凤凰酒店',
		'013'=>'荆门碧桂园凤凰酒店',
		'014'=>'随州碧桂园凤凰酒店',
		'015'=>'安庆碧桂园凤凰酒店',
		'016'=>'咸宁碧桂园凤凰温泉酒店',
		'017'=>'重庆长寿碧桂园凤凰酒店',
		'018'=>'武汉碧桂园凤凰酒店',
		'019'=>'滨湖城碧桂园凤凰酒店',
		'020'=>'韶关碧桂园凤凰酒店',
		'021'=>'黄山碧桂园凤凰酒店',
		'022'=>'池州碧桂园凤凰酒店',
		'023'=>'芜湖碧桂园玛丽蒂姆酒店',
		'024'=>'碧桂园欧洲城凤凰酒店',
		'025'=>'沈阳碧桂园假日酒店',
		'026'=>'乐昌碧桂园凤凰酒店',
		'027'=>'宁乡碧桂园凤凰酒店',
		'028'=>'佛冈碧桂园假日温泉酒店',
		'029'=>'天津碧桂园凤凰酒店',
		'030'=>'碧桂园如山湖凤凰酒店',
		'031'=>'泰州碧桂园凤凰温泉酒店',
		'032'=>'巢湖碧桂园凤凰酒店',
		'033'=>'碧桂园凤凰城酒店(南京)',
		'034'=>'碧桂园十里银滩酒店',
		'035'=>'通辽碧桂园凤凰酒店',
		'036'=>'惠阳碧桂园凤凰酒店',
		'037'=>'云浮碧桂园凤凰酒店',
		'038'=>'海城碧桂园凤凰酒店',
		'039'=>'茂名碧桂园凤凰酒店',
		'040'=>'梅州碧桂园假日酒店',
		'041'=>'张家界碧桂园凤凰酒店',
		'042'=>'贵阳碧桂园假日酒店',
		'043'=>'广州碧桂园空港凤凰酒店(广州新白云机场)',
		'044'=>'兴安盟碧桂园凤凰酒店',
		'045'=>'沈阳碧桂园凤凰酒店',
		'046'=>'碧桂园小城之春假日酒店',
		'047'=>'海南碧桂园金沙滩温泉酒店',
		'048'=>'碧桂园十里金滩酒店',
		'049'=>'碧桂园翡翠湾凤凰酒店',
		'050'=>'碧桂园太阳城凤凰酒店',
		'051'=>'北流碧桂园凤凰酒店'
	);
	
	protected $codes = array(
		'001'=>'1',
		'002'=>'2',
		'003'=>'3',
		'004'=>'7',
		'005'=>'9',
		'006'=>'16',
		'007'=>'11',
		'008'=>'6',
		'009'=>'8',
		'010'=>'4',
		'011'=>'5',
		'012'=>'10',
		'013'=>'12',
		'014'=>'13',
		'015'=>'14',
		'016'=>'15',
		'017'=>'18',
		'018'=>'19',
		'019'=>'21',
		'020'=>'20',
		'021'=>'22',
		'022'=>'25',
		'023'=>'17',
		'024'=>'29',
		'025'=>'24',
		'026'=>'28',
		'027'=>'27',
		'028'=>'23',
		'029'=>'26',
		'030'=>'30',
		'031'=>'31',
		'032'=>'33',
		'033'=>'34',
		'034'=>'35',
		'035'=>'36',
		'036'=>'37',
		'037'=>'39',
		'038'=>'38',
		'039'=>'41',
		'040'=>'32',
		'041'=>'50',
		'042'=>'63',
		'043'=>'54',
		'044'=>'40',
		'045'=>'59',
		'046'=>'44',
		'047'=>'42',
		'048'=>'43',
		'049'=>'45',
		'050'=>'61',
		'051'=>'60'
	);
	
	public function getCodes($code)
	{
		return $this->codes[$code];
	}
	
	public function getHotels()
	{
		return $this->hotels;
	}
	
	public function getHotelName($code)
	{
		if(isset($this->hotels[$code])) {
			return $this->hotels[$code];
		} else {
			return false;
		}
	}
}